{"posts": [{"title": "My son is saying he didn't build this and that he just found it, is he lying to me? Can something like this just spawn?", "body": "", "id": "12sci12", "upvotes": 8571, "url": "https://i.redd.it/7dmxb9rakyua1.jpg", "permalink": "/r/Minecraft/comments/12sci12/my_son_is_saying_he_didnt_build_this_and_that_he/", "comments": ["Lol. I'm sick rn but will try to write messahe I wanted to say later. wish me health and the world pls", "That's exactly what my kid did between naps on his sick day yesterday."]}, {"title": "Just made a skulk pit as a build, but it just feels a bit plain. Is there anything I could add to make it…skulkier?", "body": "", "id": "12lct4g", "upvotes": 6522, "url": "https://i.redd.it/8di63ekobsta1.jpg", "permalink": "/r/Minecraft/comments/12lct4g/just_made_a_skulk_pit_as_a_build_but_it_just/", "comments": ["I don’t know why but glass made with amethyst would be sick."]}, {"title": "5221 Days in my hardcore world and I still haven't finished my starter house how do you guys build so fast?", "body": "", "id": "12kxrml", "upvotes": 7740, "url": "https://i.redd.it/zubhq4qryota1.png", "permalink": "/r/Minecraft/comments/12kxrml/5221_days_in_my_hardcore_world_and_i_still_havent/", "comments": ["I wanna explore this, this looks sick", "It looks sick, not in a good way. Not enough texture on the walls given the size"]}, {"title": "What should I build in this lagoon?", "body": "", "id": "12c8v4d", "upvotes": 5930, "url": "https://i.redd.it/al2p6tl3yzra1.png", "permalink": "/r/Minecraft/comments/12c8v4d/what_should_i_build_in_this_lagoon/", "comments": ["Those sick ravine houses around the walls, like this \n[like this](https://i.imgur.com/hS0Uqyg.jpg)", "A sick bridge base. Loads of hanging chains and lanterns etc.  shack in the middle, and that's a cool house right there", "Make the pool deeper and make a mini-Atlantis, but like, not ruins.\n\nMake it a cube segment design with focus on the height though, would be sick."]}, {"title": "Any ideas on what I should build?", "body": "", "id": "11kaqqb", "upvotes": 13765, "url": "https://i.redd.it/8lzla87ml7ma1.jpg", "permalink": "/r/Minecraft/comments/11kaqqb/any_ideas_on_what_i_should_build/", "comments": ["Looks sick the way it is I'd leave it alone, a national park one might say", "Dude a hanging base would be sick!", "It looks like the base of an arm coming out of the ground, if you can fix the top and have like a secret entrance that would be sick"]}, {"title": "Do people still building these?", "body": "", "id": "12knmav", "upvotes": 13371, "url": "https://i.redd.it/4qdzd5qybnta1.png", "permalink": "/r/Minecraft/comments/12knmav/do_people_still_building_these/", "comments": ["Why not put arrows in it and flip the door and make it like a mob trap? I think that’d be sick — if there was a way to do that, anyway\nI dunno I haven’t played Minecraft in a while 😅"]}, {"title": "Does anyone have any idea what I can build here? I really want to build but I can’t think of anything. Thanks", "body": "", "id": "122lrn8", "upvotes": 2487, "url": "https://i.redd.it/5792zowmk4qa1.jpg", "permalink": "/r/Minecraft/comments/122lrn8/does_anyone_have_any_idea_what_i_can_build_here_i/", "comments": ["Do a face statue comin' out the mountain, that'd be sick! Or a bunch of houses suspended on the side of the cliff."]}, {"title": "My first atempt at a windmill build. How did i do?", "body": "", "id": "121pf40", "upvotes": 3239, "url": "https://i.redd.it/0g1r56iylwpa1.png", "permalink": "/r/Minecraft/comments/121pf40/my_first_atempt_at_a_windmill_build_how_did_i_do/", "comments": ["It certainly mills wind. (It looks sick I love it)"]}, {"title": "I dried and terraformed an entire lake, what should I build here? (before and after)", "body": "", "id": "12f4kqv", "upvotes": 891, "url": "https://www.reddit.com/gallery/12f4kqv", "permalink": "/r/Minecraft/comments/12f4kqv/i_dried_and_terraformed_an_entire_lake_what/", "comments": ["I would propose a regular Minecraft village, maybe with some spruced up buildings, but with a wall on the outer perimeter of where the lake used to be, implying that said village has had conflict before.\n\n&#x200B;\n\nBut also, the anti-lake looks sick, it must have taken time and dedication to complete. Good job!"]}, {"title": "I am trying to make a word filled with Pokémon! I want to build them as small as possible but still detailed enough so when I get to building some giant Pokémon, it will be up to scale. I chose seed that has multiple biomes close to each other so I can build Pokémon in their habitats :)", "body": "", "id": "136jqzl", "upvotes": 341, "url": "https://www.reddit.com/gallery/136jqzl", "permalink": "/r/Minecraft/comments/136jqzl/i_am_trying_to_make_a_word_filled_with_pokémon_i/", "comments": ["That’s sick"]}, {"title": "My friends look at me weird for building a ruined castle instead of a \"Functioning\" one.", "body": "", "id": "12ey38m", "upvotes": 6242, "url": "https://i.redd.it/2xc3so4utisa1.png", "permalink": "/r/Minecraft/comments/12ey38m/my_friends_look_at_me_weird_for_building_a_ruined/", "comments": ["To be honest that looks pretty sick, I find myself more impressed with builds that look old or abandoned. Super cool keep it up!", "No, fuck them,this looks sick", "Na that’s sick", "Nah this looks sick, keep it up"]}, {"title": "Best world gen i've ever gotten. Any ideas on what to build here?", "body": "", "id": "10crqnn", "upvotes": 20779, "url": "https://i.redd.it/pxq4jcf689ca1.png", "permalink": "/r/Minecraft/comments/10crqnn/best_world_gen_ive_ever_gotten_any_ideas_on_what/", "comments": ["Perhaps a castle on the mountain close to the bay and a full harbor with ships that act as houses for villagers(creating your own artificial village.\n\nAlso a sick nether portal with half a ship wreck in its guts(perhaps on the inside of the cliff)", "Looks big enough to fit a sculpture of ur mum 🤡\n\nJk jk jk\n\nThink an abandoned ship would look sick there.", "I'd say something like a Mystical island or structure floating above the water, connected to the sides by some chains or something.\n\nIn my mind it looks insanely sick.", "If it connects to ocean, a pirates cove would be pretty sick\n\nOr maybe like a massive skull", "A pirate ship hidden in a cove would be sick", "A village on the water connected by little bridges would be sick", "chains or ropes holding up the main base over the water would be sick", "This would make a sick site for a submarine base", "That is sick AF; perfect to build a temple entrance, or a cliffside base.\n\n~~Mind sharing the coords and seed?~~ Nvm, found it in the comments; thanks for the share!", "Looks sick, I'll def check it out ASAP"]}, {"title": "My seed, spawned in a doughnut of mountains and meadows and 2 villages, I am trying to build a civilization here. So far its a jumbled mess but Im trying to structure it as much as possible. 5x5 maps.", "body": "", "id": "11dgux7", "upvotes": 5705, "url": "https://i.redd.it/ytib9tlvirka1.png", "permalink": "/r/Minecraft/comments/11dgux7/my_seed_spawned_in_a_doughnut_of_mountains_and/", "comments": ["This is sick, nice job so far", "Oh sick! So, should I revert my version of minecraft to 1.18? In your opinion do you think the villages are nice, or should I go with the 3 ancient cities with the newer update 1.19?"]}, {"title": "new base location. what should i build here?", "body": "", "id": "10smo84", "upvotes": 3278, "url": "https://i.redd.it/h45tyeehpzfa1.png", "permalink": "/r/Minecraft/comments/10smo84/new_base_location_what_should_i_build_here/", "comments": ["Bro that’s sick and I thought my inside mountain pretty big base was cool that’ll be sick I’m not that good at mc and don’t have the best luck with diamonds so I still haven’t beaten the dragon on my new world but I’ll get there"]}]}